zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/startup_MIMXRT758S_cm33_core0.cpp
#define _vStackTop  __StackTop
#define _vStackBase __StackLimit

extern uint32_t _image_size[];

/*
 * Data section ROM and RAM addresses
 */
extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];
extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];

/*
 * Non Cache Data section ROM and RAM addresses
 */
extern uint32_t __NDATA_ROM[];
extern uint32_t __noncachedata_start__[];
extern uint32_t __noncachedata_init_end__[];
extern uint32_t __noncachedata_end__[];

#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)

//*****************************************************************************
// External declaration for image type and load address from  Linker Script
//*****************************************************************************
WEAK extern void __imghdr_loadaddress();
WEAK extern void __imghdr_imagetype();

//*****************************************************************************
#if defined(__cplusplus)
} // extern "C"
#endif //(__cplusplus)
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void (*const __Vectors[])(void);
#define __vector_table __Vectors
__attribute__((used, section(".isr_vector"))) void (*const __Vectors[])(void) = {
#elif defined(__MCUXPRESSO)
extern void (*const g_pfnVectors[])(void);
extern void *__Vectors __attribute__((alias("g_pfnVectors")));
#define __vector_table g_pfnVectors
__attribute__((used, section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
#elif defined(__ICCARM__)
extern void (*const __vector_table[])(void);
/* The vector table is not needed for initialization. */
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));
__attribute__((used, section(".intvec"))) void (*const __vector_table[])(void) = {
#elif defined(__GNUC__)
extern void (*const __isr_vector[])(void);
#define __vector_table __isr_vector
__attribute__((used, section(".isr_vector"))) void (*const __isr_vector[])(void) = {
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)
    // Core Level - CM33
    (void (*)())((uint32_t)_vStackTop), // The initial stack pointer
    Reset_Handler,                      // The reset handler

    NMI_Handler,                        // NMI Handler
    HardFault_Handler,                  // Hard Fault Handler
    MemManage_Handler,                  // MPU Fault Handler
    BusFault_Handler,                   // Bus Fault Handler
    UsageFault_Handler,                 // Usage Fault Handler
    SecureFault_Handler,                // Secure Fault Handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
    (void (*)())0x180000,               // Image length
#else
    (void (*)())((uint32_t)_image_size), // Image length
#endif                                  //(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2)
    __imghdr_imagetype,                 // Image type
    0,                                  // Reserved
    SVC_Handler,                        // SVCall Handler
    DebugMon_Handler,                   // Debug Monitor Handler
    (void (*)())__vector_table,         // Image load address
    PendSV_Handler,                     // PendSV Handler
    SysTick_Handler,                    // SysTick Handler

    // Chip Level - MIMXRT758S_cm33_core0
    Reserved16_IRQHandler,             // 16 : Reserved interrupt
    UTICK0_IRQHandler,                 // 17 : Micro-tick Timer
    MRT0_IRQHandler,                   // 18 : MRT: Ored Interrupt request
    CTIMER0_IRQHandler,                // 19 : CTIMER: Interrupt request
    CTIMER1_IRQHandler,                // 20 : CTIMER: Interrupt request
    SCT0_IRQHandler,                   // 21 : SCT: Interrupt request
    CTIMER3_IRQHandler,                // 22 : CTIMER: Interrupt request
    LP_FLEXCOMM0_IRQHandler,           // 23 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM1_IRQHandler,           // 24 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM2_IRQHandler,           // 25 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM3_IRQHandler,           // 26 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM4_IRQHandler,           // 27 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM5_IRQHandler,           // 28 : FLEXCOMM: Interrupt request
    LPSPI14_IRQHandler,                // 29 : LPSPI: Interrupt request
    LPI2C15_IRQHandler,                // 30 : LPI2C: Interrupt request
    ADC_IRQHandler,                    // 31 : ADC0: Interrupt request
    SDADC_IRQHandler,                  // 32 : SDADC0: Interrupt request
    ACMP_IRQHandler,                   // 33 : ACMP: interrupt request
    PDM_EVENT_IRQHandler,              // 34 : MIC: Interrupt request for read data or Error
    PDM_HWVAD_EVENT_IRQHandler,        // 35 : MIC: Hardware Voice Activity Detector interrupt or error interrupt
    HYPERVISOR_IRQHandler,             // 36 : SECURE: Compute domain P-Bus Hypervisor interrupt
    SECURE_VIOLATION_IRQHandler,       // 37 : SECURE: Compute domain P-Bus Secure violation interrupt
    SENSE_HYPERVISOR_IRQHandler,       // 38 : Sense domain Hypervisor interrupt
    SENSE_SECURE_VIOLATION_IRQHandler, // 39 : Sense domain Secure violation interrupt
    MEDIA_HYPERVISOR_IRQHandler,       // 40 : Media domain Hypervisor interrupt
    MEDIA_SECURE_VIOLATION_IRQHandler, // 41 : Media domain Secure violation interrupt
    RTC0_ALARM_IRQHandler,             // 42 : RTC: Alarm interrupt
    RTC0_IRQHandler,                   // 43 : RTC: wakeup interrupt to Compute domain
    Reserved44_IRQHandler,             // 44 : Reserved interrupt
    MU0_A_IRQHandler,                  // 45 : MU0: MUA, CPU0 to HiFi1
    MU1_A_IRQHandler,                  // 46 : MU1: MUA, CPU0 to CPU1
    Reserved47_IRQHandler,             // 47 : Reserved interrupt
    CTIMER2_IRQHandler,                // 48 : CTIMER: Interrupt request
    CTIMER4_IRQHandler,                // 49 : CTIMER: Interrupt request
    OS_EVENT_IRQHandler,               // 50 : OSEVENT: Event timer CPU0 Wakeup/interrupt
    LP_FLEXCOMM6_IRQHandler,           // 51 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM7_IRQHandler,           // 52 : FLEXCOMM: Interrupt request
    USDHC0_IRQHandler,                 // 53 : USDHC: Interrupt request
    USDHC1_IRQHandler,                 // 54 : USDHC: Interrupt request
    I3C0_IRQHandler,                   // 55 : I3C: Interrupt Request
    USB0_IRQHandler,                   // 56 : USB: HSUSB Interrup request
    USB1_IRQHandler,                   // 57 : USB: eUSB Interrup request
    WDT0_IRQHandler,                   // 58 : WDT: Interrupt request
    WDT1_IRQHandler,                   // 59 : WDT: Interrupt request
    USBPHY0_IRQHandler,                // 60 : HSUSBPHY: UTM interrupt request
    PUF_IRQHandler,                    // 61 : PUF: Interrupt Request
    Reserved62_IRQHandler,             // 62 : Reserved interrupt
    LP_FLEXCOMM8_IRQHandler,           // 63 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM9_IRQHandler,           // 64 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM10_IRQHandler,          // 65 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM11_IRQHandler,          // 66 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM12_IRQHandler,          // 67 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM13_IRQHandler,          // 68 : FLEXCOMM: Interrupt request
    LPSPI16_IRQHandler,                // 69 : LPSPI: Interrupt request
    I3C1_IRQHandler,                   // 70 : I3C: Interrupt Request
    FLEXIO_IRQHandler,                 // 71 : FLEXIO: Interrupt request
    LCDIF_IRQHandler,                  // 72 : LCDIF: Interrupt request
    VGPU_IRQHandler,                   // 73 : VGPU: Interrupt from graphics core (Domain HCLK)
    MIPI_IRQHandler,                   // 74 : DSI: Interrupt request
    EDMA0_CH0_IRQHandler,              // 75 : EDMA: Channel 0 interrupt
    EDMA0_CH1_IRQHandler,              // 76 : EDMA: Channel 1 interrupt
    EDMA0_CH2_IRQHandler,              // 77 : EDMA: Channel 2 interrupt
    EDMA0_CH3_IRQHandler,              // 78 : EDMA: Channel 3 interrupt
    EDMA0_CH4_IRQHandler,              // 79 : EDMA: Channel 4 interrupt
    EDMA0_CH5_IRQHandler,              // 80 : EDMA: Channel 5 interrupt
    EDMA0_CH6_IRQHandler,              // 81 : EDMA: Channel 6 interrupt
    EDMA0_CH7_IRQHandler,              // 82 : EDMA: Channel 7 interrupt
    EDMA0_CH8_IRQHandler,              // 83 : EDMA: Channel 8 interrupt
    EDMA0_CH9_IRQHandler,              // 84 : EDMA: Channel 9 interrupt
    EDMA0_CH10_IRQHandler,             // 85 : EDMA: Channel 10 interrupt
    EDMA0_CH11_IRQHandler,             // 86 : EDMA: Channel 11 interrupt
    EDMA0_CH12_IRQHandler,             // 87 : EDMA: Channel 12 interrupt
    EDMA0_CH13_IRQHandler,             // 88 : EDMA: Channel 13 interrupt
    EDMA0_CH14_IRQHandler,             // 89 : EDMA: Channel 14 interrupt
    EDMA0_CH15_IRQHandler,             // 90 : EDMA: Channel 15 interrupt
    EDMA1_CH0_IRQHandler,              // 91 : EDMA: Channel 0 interrupt
    EDMA1_CH1_IRQHandler,              // 92 : EDMA: Channel 1 interrupt
    EDMA1_CH2_IRQHandler,              // 93 : EDMA: Channel 2 interrupt
    EDMA1_CH3_IRQHandler,              // 94 : EDMA: Channel 3 interrupt
    EDMA1_CH4_IRQHandler,              // 95 : EDMA: Channel 4 interrupt
    EDMA1_CH5_IRQHandler,              // 96 : EDMA: Channel 5 interrupt
    EDMA1_CH6_IRQHandler,              // 97 : EDMA: Channel 6 interrupt
    EDMA1_CH7_IRQHandler,              // 98 : EDMA: Channel 7 interrupt
    EDMA1_CH8_IRQHandler,              // 99 : EDMA: Channel 8 interrupt
    EDMA1_CH9_IRQHandler,              // 100: EDMA: Channel 9 interrupt
    EDMA1_CH10_IRQHandler,             // 101: EDMA: Channel 10 interrupt
    EDMA1_CH11_IRQHandler,             // 102: EDMA: Channel 11 interrupt
    EDMA1_CH12_IRQHandler,             // 103: EDMA: Channel 12 interrupt
    EDMA1_CH13_IRQHandler,             // 104: EDMA: Channel 13 interrupt
    EDMA1_CH14_IRQHandler,             // 105: EDMA: Channel 14 interrupt
    EDMA1_CH15_IRQHandler,             // 106: EDMA: Channel 15 interrupt
    GPIO00_IRQHandler,                 // 107: GPIO: Interupt request, channel 0
    GPIO01_IRQHandler,                 // 108: GPIO: Interupt request, channel 1
    GPIO10_IRQHandler,                 // 109: GPIO: Interupt request, channel 0
    GPIO11_IRQHandler,                 // 110: GPIO: Interupt request, channel 1
    GPIO20_IRQHandler,                 // 111: GPIO: Interupt request, channel 0
    GPIO21_IRQHandler,                 // 112: GPIO: Interupt request, channel 1
    GPIO30_IRQHandler,                 // 113: GPIO: Interupt request, channel 0
    GPIO31_IRQHandler,                 // 114: GPIO: Interupt request, channel 1
    GPIO40_IRQHandler,                 // 115: GPIO: Interupt request, channel 0
    GPIO41_IRQHandler,                 // 116: GPIO: Interupt request, channel 1
    GPIO50_IRQHandler,                 // 117: GPIO: Interupt request, channel 0
    GPIO51_IRQHandler,                 // 118: GPIO: Interupt request, channel 1
    GPIO60_IRQHandler,                 // 119: GPIO: Interupt request, channel 0
    GPIO61_IRQHandler,                 // 120: GPIO: Interupt request, channel 1
    GPIO70_IRQHandler,                 // 121: GPIO: Interupt request, channel 0
    GPIO71_IRQHandler,                 // 122: GPIO: Interupt request, channel 1
    PIN_INT0_IRQHandler,               // 123: PINT: Interupt request 0
    PIN_INT1_IRQHandler,               // 124: PINT: Interupt request 1
    PIN_INT2_IRQHandler,               // 125: PINT: Interupt request 2
    PIN_INT3_IRQHandler,               // 126: PINT: Interupt request 3
    PIN_INT4_IRQHandler,               // 127: PINT: Interupt request 4
    PIN_INT5_IRQHandler,               // 128: PINT: Interupt request 5
    PIN_INT6_IRQHandler,               // 129: PINT: Interupt request 6
    PIN_INT7_IRQHandler,               // 130: PINT: Interupt request 7
    SAI0_IRQHandler,                   // 131: SAI: TX/RX interrupt
    SAI1_IRQHandler,                   // 132: SAI: TX/RX interrupt
    SAI2_IRQHandler,                   // 133: SAI: TX/RX interrupt
    XSPI0_IRQHandler,                  // 134: xSPI: Ored interrupt
    XSPI1_IRQHandler,                  // 135: xSPI: Ored interrupt
    XSPI2_IRQHandler,                  // 136: xSPI: Ored interrupt
    MMU0_IRQHandler,                   // 137: MMU: Interrupt request
    MMU1_IRQHandler,                   // 138: MMU: Interrupt request
    MMU2_IRQHandler,                   // 139: MMU: Interrupt request
    Freqme_IRQHandler,                 // 140: FREQME: Interrupt request
    GDET0_IRQHandler,                  // 141: GDET0: Interrupt request
    Reserved142_IRQHandler,            // 142: Reserved interrupt
    Reserved143_IRQHandler,            // 143: Reserved interrupt
    GDET3_IRQHandler,                  // 144: GDET3: Interrupt request
    CDOG0_IRQHandler,                  // 145: CDOG: Interrupt request
    CDOG1_IRQHandler,                  // 146: CDOG: Interrupt request
    CDOG2_IRQHandler,                  // 147: CDOG: Interrupt request
    ITRC0_IRQHandler,                  // 148: ITRC: Interrupt, cleared by software
    ELS_IRQHandler,                    // 149: ELS Interrupt request
    PKC_IRQHandler,                    // 150: PKC: Public Key Cryptography Interrutp
    OSCCA_IRQHandler,                  // 151: OSCCA: OSCCA Interrupt request
    SLEEPCON0_IRQHandler,              // 152: WAKEUP: CPU0 wakeup event
    CPU0_IRQHandler,                   // 153: CTI0: interrupt request
    PMC_IRQHandler,                    // 154: PMC: Compute domain Interrupt
    JPEGDEC_IRQHandler,                // 155: JPEGDEC: Ored Context 0-3 interrupt request
    PNGDEC_IRQHandler,                 // 156: PGNDEC: Interrut request
    NPU_IRQHandler,                    // 157: NPU: Interrupt request
    TRNG_IRQHandler,                   // 158: TRNG: interrupt
    TEMPDET0_IRQHandler,               // 159: TEMPDET0: Interrupt request 0
    TEMPDET1_IRQHandler,               // 160: TEMPDET1: Interrupt request 1
    EZHV_IRQHandler,                   // 161: EZH-V: Interrupt request
    GLIKEY0_IRQHandler,                // 162: GLIKEY: Interrupt
    GLIKEY2_IRQHandler,                // 163: GLIKEY: Interrupt
    GLIKEY3_IRQHandler,                // 164: GLIKEY: Interrupt
    GLIKEY5_IRQHandler,                // 165: GLIKEY: Interrupt
    PVTS0_CPU0_IRQHandler,             // 166: PVTS0 CPU0 interrupt
    Reserved167_IRQHandler,            // 167: Reserved interrupt
    PVTS0_HIFI4_IRQHandler,            // 168: PVTS0 HIFI4 interrupt
    Reserved169_IRQHandler,            // 169: Reserved interrupt
    FRO0_IRQHandler,                   // 170: FRO: 300MHz FRO in VDD2 domain Async interrupt
    FRO1_IRQHandler,                   // 171: FRO: 192MHz FRO in VDD2 domain Async interrupt
    FRO2_IRQHandler,                   // 172: FRO: 300MHz FRO in VDD1 domain Async interrupt
    OCOTP_IRQHandler,                  // 173: OCOTP warning and integrity error interrupt
};                                     /* End of __vector_table */

#if defined(__MCUXPRESSO)
#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void *__VECTOR_TABLE __attribute__((alias("g_pfnVectors")));
void (*__VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif //(ENABLE_RAM_VECTOR_TABLE)

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;
#endif //(__MCUXPRESSO)

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
void Reset_Handler_C(void)
{
#if !defined(__NO_SYSTEM_INIT)
    SystemInit();
#endif //(__NO_SYSTEM_INIT)

