zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/startup_MIMXRT758S_cm33_core0.cpp
WEAK void EDMA1_CH12_IRQHandler(void)
{
    EDMA1_CH12_DriverIRQHandler();
}

WEAK void EDMA1_CH13_IRQHandler(void)
{
    EDMA1_CH13_DriverIRQHandler();
}

WEAK void EDMA1_CH14_IRQHandler(void)
{
    EDMA1_CH14_DriverIRQHandler();
}

WEAK void EDMA1_CH15_IRQHandler(void)
{
    EDMA1_CH15_DriverIRQHandler();
}

WEAK void GPIO00_IRQHandler(void)
{
    GPIO00_DriverIRQHandler();
}

WEAK void GPIO01_IRQHandler(void)
{
    GPIO01_DriverIRQHandler();
}

WEAK void GPIO10_IRQHandler(void)
{
    GPIO10_DriverIRQHandler();
}

WEAK void GPIO11_IRQHandler(void)
{
    GPIO11_DriverIRQHandler();
}

WEAK void GPIO20_IRQHandler(void)
{
    GPIO20_DriverIRQHandler();
}

WEAK void GPIO21_IRQHandler(void)
{
    GPIO21_DriverIRQHandler();
}

WEAK void GPIO30_IRQHandler(void)
{
    GPIO30_DriverIRQHandler();
}

WEAK void GPIO31_IRQHandler(void)
{
    GPIO31_DriverIRQHandler();
}

WEAK void GPIO40_IRQHandler(void)
{
    GPIO40_DriverIRQHandler();
}

WEAK void GPIO41_IRQHandler(void)
{
    GPIO41_DriverIRQHandler();
}

WEAK void GPIO50_IRQHandler(void)
{
    GPIO50_DriverIRQHandler();
}

WEAK void GPIO51_IRQHandler(void)
{
    GPIO51_DriverIRQHandler();
}

WEAK void GPIO60_IRQHandler(void)
{
    GPIO60_DriverIRQHandler();
}

WEAK void GPIO61_IRQHandler(void)
{
    GPIO61_DriverIRQHandler();
}

WEAK void GPIO70_IRQHandler(void)
{
    GPIO70_DriverIRQHandler();
}

WEAK void GPIO71_IRQHandler(void)
{
    GPIO71_DriverIRQHandler();
}

WEAK void PIN_INT0_IRQHandler(void)
{
    PIN_INT0_DriverIRQHandler();
}

WEAK void PIN_INT1_IRQHandler(void)
{
    PIN_INT1_DriverIRQHandler();
}

WEAK void PIN_INT2_IRQHandler(void)
{
    PIN_INT2_DriverIRQHandler();
}

WEAK void PIN_INT3_IRQHandler(void)
{
    PIN_INT3_DriverIRQHandler();
}

WEAK void PIN_INT4_IRQHandler(void)
{
    PIN_INT4_DriverIRQHandler();
}

WEAK void PIN_INT5_IRQHandler(void)
{
    PIN_INT5_DriverIRQHandler();
}

WEAK void PIN_INT6_IRQHandler(void)
{
    PIN_INT6_DriverIRQHandler();
}

WEAK void PIN_INT7_IRQHandler(void)
{
    PIN_INT7_DriverIRQHandler();
}

WEAK void SAI0_IRQHandler(void)
{
    SAI0_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{
    SAI1_DriverIRQHandler();
}

WEAK void SAI2_IRQHandler(void)
{
    SAI2_DriverIRQHandler();
}

WEAK void XSPI0_IRQHandler(void)
{
    XSPI0_DriverIRQHandler();
}

WEAK void XSPI1_IRQHandler(void)
{
    XSPI1_DriverIRQHandler();
}

WEAK void XSPI2_IRQHandler(void)
{
    XSPI2_DriverIRQHandler();
}

WEAK void MMU0_IRQHandler(void)
{
    MMU0_DriverIRQHandler();
}

WEAK void MMU1_IRQHandler(void)
{
    MMU1_DriverIRQHandler();
}

WEAK void MMU2_IRQHandler(void)
{
    MMU2_DriverIRQHandler();
}

WEAK void Freqme_IRQHandler(void)
{
    Freqme_DriverIRQHandler();
}

WEAK void GDET0_IRQHandler(void)
{
    GDET0_DriverIRQHandler();
}

WEAK void Reserved142_IRQHandler(void)
{
    Reserved142_DriverIRQHandler();
}

WEAK void Reserved143_IRQHandler(void)
{
    Reserved143_DriverIRQHandler();
}

WEAK void GDET3_IRQHandler(void)
{
    GDET3_DriverIRQHandler();
}

WEAK void CDOG0_IRQHandler(void)
{
    CDOG0_DriverIRQHandler();
}

WEAK void CDOG1_IRQHandler(void)
{
    CDOG1_DriverIRQHandler();
}

WEAK void CDOG2_IRQHandler(void)
{
    CDOG2_DriverIRQHandler();
}

WEAK void ITRC0_IRQHandler(void)
{
    ITRC0_DriverIRQHandler();
}

WEAK void ELS_IRQHandler(void)
{
    ELS_DriverIRQHandler();
}

WEAK void PKC_IRQHandler(void)
{
    PKC_DriverIRQHandler();
}

WEAK void OSCCA_IRQHandler(void)
{
    OSCCA_DriverIRQHandler();
}

WEAK void SLEEPCON0_IRQHandler(void)
{
    SLEEPCON0_DriverIRQHandler();
}

WEAK void CPU0_IRQHandler(void)
{
    CPU0_DriverIRQHandler();
}

WEAK void PMC_IRQHandler(void)
{
    PMC_DriverIRQHandler();
}

WEAK void JPEGDEC_IRQHandler(void)
{
    JPEGDEC_DriverIRQHandler();
}

WEAK void PNGDEC_IRQHandler(void)
{
    PNGDEC_DriverIRQHandler();
}

WEAK void NPU_IRQHandler(void)
{
    NPU_DriverIRQHandler();
}

WEAK void TRNG_IRQHandler(void)
{
    TRNG_DriverIRQHandler();
}

WEAK void TEMPDET0_IRQHandler(void)
{
    TEMPDET0_DriverIRQHandler();
}

WEAK void TEMPDET1_IRQHandler(void)
{
    TEMPDET1_DriverIRQHandler();
}

WEAK void EZHV_IRQHandler(void)
{
    EZHV_DriverIRQHandler();
}

WEAK void GLIKEY0_IRQHandler(void)
{
    GLIKEY0_DriverIRQHandler();
}

WEAK void GLIKEY2_IRQHandler(void)
{
    GLIKEY2_DriverIRQHandler();
}

WEAK void GLIKEY3_IRQHandler(void)
{
    GLIKEY3_DriverIRQHandler();
}

WEAK void GLIKEY5_IRQHandler(void)
{
    GLIKEY5_DriverIRQHandler();
}

WEAK void PVTS0_CPU0_IRQHandler(void)
{
    PVTS0_CPU0_DriverIRQHandler();
}

WEAK void Reserved167_IRQHandler(void)
{
    Reserved167_DriverIRQHandler();
}

WEAK void PVTS0_HIFI4_IRQHandler(void)
{
    PVTS0_HIFI4_DriverIRQHandler();
}

WEAK void Reserved169_IRQHandler(void)
{
    Reserved169_DriverIRQHandler();
}

WEAK void FRO0_IRQHandler(void)
{
    FRO0_DriverIRQHandler();
}

WEAK void FRO1_IRQHandler(void)
{
    FRO1_DriverIRQHandler();
}

WEAK void FRO2_IRQHandler(void)
{
    FRO2_DriverIRQHandler();
}

WEAK void OCOTP_IRQHandler(void)
{
    OCOTP_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif //(__GNUC__)
#endif //(DEBUG)
